#language: ja
フィーチャ: サービスにログイン/ログアウトする
  シナリオ: トップページにログインリンク
    もし "the homepage"ページを表示している
    ならば "twitter でログイン"と表示されていること

  シナリオ: あたらしいアカウントを登録する
    もし twitter ログイン
    ならば "新規"と表示されていること
    かつ "既存"と表示されていないこと
    かつ "ログインしました"と表示されていること

  シナリオ: 既存アカウントにログインする
    前提 twitter アカウントを登録している
    もし twitter ログイン
    ならば "既存"と表示されていること
    かつ "新規"と表示されていないこと
    かつ "ログインしました"と表示されていること

  シナリオ: ログアウトする
    もし twitter ログイン
    かつ "Sign out"リンクをクリックする
    ならば "ログアウトしました"と表示されていること
    かつ "twitter でログイン"と表示されていること

  シナリオ: mixiアカウントを既存アカウントに関連づける
